In [1]:
#pip install sqlalchemy
#pip install lxml
#pip install html5lib
#pip install Beautifulsoup4

## Data Input and Output
CSV
Excel
HTML
SQL

In [2]:
import pandas as pd

In [3]:
pwd

'd:\\NOTES\\EXTRACURRICULAR\\notes for python for ds&ml'

In [4]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df.to_csv('My_output',index=False) #make index false so that when the file is read again it will not interrupt the pandas to add it's index

In [6]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
pd.read_excel('Excel_Sample.xlsx',sheet_name ='Sheet1')

   index    a   b   c   d
0       0   0   1   2   3
1       1   4   5   6   7
2       2   8   9  10  11
3       3  12  13  14  15

In [8]:
#data = pd.read_csv('banklist.csv')
#pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

type(data)

list

In [9]:
data[0] #use it to run it and get the table as per the need

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
...,...,...,...,...,...,...,...
563,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
564,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
565,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
566,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
567,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [10]:
df = pd.DataFrame(data) #we cannot directly use sometime

ValueError: Must pass 2-d input. shape=(1, 568, 7)

In [11]:
from sqlalchemy import create_engine

In [12]:
engine = create_engine('sqlite:///:memory:')

In [13]:
df.to_sql('my_table',engine,index=False) #read it's documentation for more information

4

In [14]:
sqldf = pd.read_sql('my_table',con=engine)

In [15]:
sqldf

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15